.emacs.d/config.org
** Tab-bar-mode
I initially thought that this would be able to replace =perspective.el=, but it doesn't currently have the ability to isolate buffer lists. I really like the idea of using base Emacs functionalities wherever possible, so I'm keeping this around in case it ever becomes more useful in the future. I got some help for these functions from [[https://mmk2410.org/2022/02/11/using-emacs-tab-bar-mode/]]

#+BEGIN_SRC emacs-lisp
;; (defun ns/tab-bar-switch-or-create (name func)
;;   (if (ns/tab-bar-tab-exists name)
;;       (tab-bar-switch-to-tab name)
;;     (ns/tab-bar-new-tab name func)))

;; (defun ns/tab-bar-tab-exists (name)
;;   (member name
;;           (mapcar #'(lambda (tab) (alist-get 'name tab))
;;                   (tab-bar-tabs))))

;; (defun ns/tab-bar-new-tab (name func)
;;   (when (eq nil tab-bar-mode)
;;     (tab-bar-mode))
;;   (tab-bar-new-tab)
;;   (tab-bar-rename-tab name)
;;   (when func ;; If func is nil, don't try to run it
;;       (funcall func)))

(use-package tab-bar
  :straight (:type built-in)
  :custom
  (tab-bar-show nil))

  ;; :config
  ;; (setf mode-line-misc-info ;; I got this from the Hammy README.md
  ;;       ;; When the tab-bar is active, don't show global-mode-string
  ;;       ;; in mode-line-misc-info, because we now show that in the
  ;;       ;; tab-bar using `tab-bar-format-align-right' and
  ;;       ;; `tab-bar-format-global'.
  ;;       (remove '(global-mode-string ("" global-mode-string))
  ;;               mode-line-misc-info))
  ;; (unless (member 'tab-bar-format-global tab-bar-format)
  ;;   ;; Show `global-mode-string' in the tab bar.
  ;;   (setf tab-bar-format (append tab-bar-format '(tab-bar-format-align-right tab-bar-format-global)))))
#+END_SRC 

** Tabspaces
A light wrapper around ~project.el~ and ~tab-bar-mode~ providing isolated buffer lists with per-project tab-bars. /This might be unnecessary, I might be fine with just builtin consult project narrowing/

#+BEGIN_SRC emacs-lisp
(use-package tabspaces
  :straight (:type git :host github :repo "mclear-tools/tabspaces")
  :hook (after-init . tabspaces-mode)
  :commands (tabspaces-switch-or-create-workspace
             tabspaces-open-or-create-project-and-workspace)
  :custom
  (tabspaces-use-filtered-buffers-as-default t)
  (tabspaces-default-tab "Default")
  (tabspaces-remove-to-default t)
  (tabspaces-include-buffers '("*scratch*"))

  ; sessions
  ; (tabspaces-session t)
  ; (tabspaces-session-auto-restore t))

  ;; Filter buffers for consult-buffer
  :config
  (with-eval-after-load 'consult
    ;; hide full buffer list
    (consult-customize consult--source-buffer :hidden t :default nil)
    ;; set consult-workspace buffer list
    (defvar consult--source-workspace
      (list :name     "Workspace Buffers"
            :narrow   ?w
            :history  'buffer-name-history
            :category 'buffer
            :state    #'consult--buffer-state
            :default  t
            :items    (lambda () (consult--buffer-query
                                  :predicate #'tabspaces--local-buffer-p
                                  :sort 'visibility
                                  :as #'buffer-name)))
      "Set workspace buffer list for consult-buffer.")
    (add-to-list 'consult-buffer-sources 'consult--source-workspace)))
#+END_SRC

** Hammy: Pacing myself through work

#+BEGIN_SRC emacs-lisp
;; (use-package hammy
;;   :config
;;   (hammy-mode 1))
#+END_SRC

* Keybindings and Basic Feature Configuration
Here's where I configure some basic Emacs features with keybindings.

** Enable all disabled keybindings
#+BEGIN_SRC emacs-lisp
(setq disabled-command-function nil)
#+END_SRC

** Lispy: short and sweet Lisp editing

#+BEGIN_SRC emacs-lisp 
(use-package lispy
  :hook ((emacs-lisp-mode . lispy-mode)
         (clojure-mode . lispy-mode))
  :custom
  (lispy-compat '(edebug cider magit-blame-mode)))
#+END_SRC

** Electric-pair-mode
Turn on ~electric-pair-mode~ for a select subset of modes. 

#+BEGIN_SRC emacs-lisp
(electric-pair-mode 1)
(setq electric-pair-inhibit-predicate
      (lambda (char)
        (not (member major-mode '(rustic-mode
                                  go-mode
                                  python-mode)))))
#+END_SRC

** +Meow+
*** Keymap
#+BEGIN_SRC emacs-lisp :tangle no
(defun meow-setup ()
  (setq meow-cheatsheet-layout meow-cheatsheet-layout-qwerty)
  (meow-motion-overwrite-define-key
   '("j" . meow-next)
   '("k" . meow-prev)
   '("<escape>" . ignore))
  (meow-leader-define-key
   ;; SPC j/k will run the original command in MOTION state.
   '("j" . "H-j")
   '("k" . "H-k")
   ;; Use SPC (0-9) for digit arguments.
   '("1" . meow-digit-argument)
   '("2" . meow-digit-argument)
   '("3" . meow-digit-argument)
   '("4" . meow-digit-argument)
   '("5" . meow-digit-argument)
   '("6" . meow-digit-argument)
   '("7" . meow-digit-argument)
   '("8" . meow-digit-argument)
   '("9" . meow-digit-argument)
   '("0" . meow-digit-argument)
   '("/" . meow-keypad-describe-key)
   '("?" . meow-cheatsheet))
  (meow-normal-define-key
   '("0" . meow-expand-0)
   '("9" . meow-expand-9)
   '("8" . meow-expand-8)
   '("7" . meow-expand-7)
   '("6" . meow-expand-6)
   '("5" . meow-expand-5)
   '("4" . meow-expand-4)
   '("3" . meow-expand-3)
   '("2" . meow-expand-2)
   '("1" . meow-expand-1)
   '("-" . negative-argument)
   '(";" . meow-reverse)
   '("," . meow-inner-of-thing)
   '("." . meow-bounds-of-thing)
   '("[" . meow-beginning-of-thing)
   '("]" . meow-end-of-thing)
   '("a" . meow-append)
   '("A" . meow-open-below)
   '("b" . meow-back-word)
   '("B" . meow-back-symbol)
   '("c" . meow-change)
   '("d" . meow-delete)
   '("D" . meow-backward-delete)
   '("e" . meow-next-word)
   '("E" . meow-next-symbol)
   '("f" . meow-find)
   '("g" . meow-cancel-selection)
   '("G" . meow-grab)
   '("h" . meow-left)
   '("H" . meow-left-expand)
   '("i" . meow-insert)
   '("I" . meow-open-above)
   '("j" . meow-next)
   '("J" . meow-next-expand)
   '("k" . meow-prev)
   '("K" . meow-prev-expand)
   '("l" . meow-right)
   '("L" . meow-right-expand)
   '("m" . meow-join)
   '("n" . meow-search)
   '("o" . meow-block)
   '("O" . meow-to-block)
   '("p" . meow-yank)
   ;; '("q" . meow-quit)
   '("Q" . meow-goto-line)
   '("r" . meow-replace)
   '("R" . meow-swap-grab)
   '("s" . meow-kill)
   '("t" . meow-till)
   '("u" . meow-undo)
   '("U" . meow-undo-in-selection)
   '("v" . meow-visit)
   '("w" . meow-mark-word)
   '("W" . meow-mark-symbol)
   '("x" . meow-line)
   '("X" . meow-goto-line)
   '("y" . meow-save)
   '("Y" . meow-sync-grab)
   '("z" . meow-pop-selection)
   '("'" . repeat)
   '("<escape>" . ignore)))
#+END_SRC 

*** The package itself
#+BEGIN_SRC emacs-lisp :tangle no
(use-package meow
  :config
  (meow-setup)
  (meow-global-mode 1))
#+END_SRC

*** jk key chord
#+BEGIN_SRC emacs-lisp :tangle no
(use-package key-chord
  :config
  (key-chord-mode 1)
  (key-chord-define meow-insert-state-keymap "jk" [escape]))
#+END_SRC

** ESC quits prompts
Make ESC quit prompts.

#+begin_src emacs-lisp
;; (global-set-key (kbd "<escape>") 'keyboard-escape-quit)
#+end_src

** Disable ESC ESC ESC

#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "ESC ESC"))
#+END_SRC 
** Replace selected text
Enable =delete-selection-mode= so that if there is a marked region, typing in text replaces it

#+BEGIN_SRC emacs-lisp
(delete-selection-mode 1)
#+END_SRC

** Hydra
Install the base Hydra package.

#+begin_src emacs-lisp
(use-package hydra)
#+end_src

** Indentation: spaces, not tabs!
Set up the indentation behavior. I took this basic configuration from [[https://dougie.io/emacs/indentation/]]

#+begin_src emacs-lisp

;; Set the default tab settings
(setq-default tab-width 4)
(setq-default indent-tabs-mode nil)
(setq-default c-basic-offset 4)
(setq-default python-indent-offset 4)

;; Make the backspace properly erase the whole tab instead of removing
;; 1 space at a time
(setq backward-delete-char-untabify-method 'hungry)

#+end_src

** Files
Keybindings for working with files.

#+BEGIN_SRC emacs-lisp

;; Keep track of recently-opened files
(recentf-mode 1)
(setq recentf-max-menu-items 25)
(setq recentf-max-saved-items 25)
(global-set-key (kbd "C-x C-r") 'consult-recent-file)

#+END_SRC

** Windows
Keybindings for operating windows.

#+BEGIN_SRC emacs-lisp
(define-key global-map (kbd "M-o") 'ace-window)
#+END_SRC

** Search
Keybindings for searching within different contexts.

| COMMAND             | DESCRIPTION                                     | KEYBINDING |
|---------------------+-------------------------------------------------+------------|
| avy-goto-char-timer | Start typing some chars on screen, jump to them | s          |
| avy-pop-mark        | Jump back from last =avy= search                | S          |
| swiper              | Search the current buffer                       | SPC s b    |

#+BEGIN_SRC emacs-lisp

; TODO: convert this to Emacs keybindings

;; (general-define-key
;;  :states 'normal
;;  "s" 'avy-goto-char-timer
;;  "S" 'avy-pop-mark)

;; (general-define-key
;;  :states '(normal emacs)
;;  "C-s" 'consult-line)

;; (my-leader
;;   "s" '(:ignore t :which-key "search")
;;   "s b" '(consult-line :which-key "Search buffer"))

;; (use-package ag
;;   :general
;;   (my-leader
;;     "s p" '(projectile-ag :which-key "Search project")))
#+END_SRC

#+RESULTS:

** Dumb-jump

#+BEGIN_SRC emacs-lisp

(use-package dumb-jump
  :config
  (defhydra dumb-jump-hydra (:color blue :columns 3)
    "Dumb Jump"
    ("j" dumb-jump-go "Go")
    ("o" dumb-jump-go-other-window "Other window")
    ("e" dumb-jump-go-prefer-external "Go external")
    ("x" dumb-jump-go-prefer-external-other-window "Go external other window")
    ("i" dumb-jump-go-prompt "Prompt")
    ("l" dumb-jump-quick-look "Quick look")
    ("b" dumb-jump-back "Back"))
  (keymap-global-set "M-g j" 'dumb-jump-hydra/body))

#+END_SRC

* Version Control
** Magit

#+begin_src emacs-lisp
(use-package magit)
#+end_src

** Forge: issue GitHub pull requests and more

#+BEGIN_SRC emacs-lisp
;; (use-package forge
;;   :after magit)
;; TODO set up personal access token personal to work with pull requests from Emacs  :after magit)

#+END_SRC 

** Blamer: Git blame the current line

#+BEGIN_SRC emacs-lisp
(use-package blamer)
#+END_SRC 

* Org Mode
