.emacs.d/config.org
** Basic config
The very basics for Org-mode, setting up fonts and basic visual features.

#+begin_src emacs-lisp

 (defun ns/org-mode-setup ()
   (org-indent-mode)
   ;; (variable-pitch-mode 1)
   (visual-line-mode 1))

(defun ns/org-font-setup ()
  ;; Make sure that anything that should be fixed pitch in Org files actually appears that way
    (set-face-attribute 'org-block nil :foreground nil :inherit
                        'fixed-pitch)
    (set-face-attribute 'org-code nil :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-table nil :inherit '(shadow fixed-pitch))
    ;; (set-face-attribute 'org-indent nil :inherit '(org-hide fixed-pitch))
    (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-special-keyword nil :inherit
                    '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-meta-line nil :inherit
                        '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch))

;; Got this from https://stackoverflow.com/questions/10969617/hiding-markup-elements-in-org-mode
;; (defun ns/org-toggle-emphasis ()
;;   "Toggle hiding/showing of org emphasis markers"
;;   (interactive)
;;   (if org-hide-emphasis-markers
;;       (set-variable 'org-hide-emphasis-markers nil)
;;     (set-variable 'org-hide-emphasis-markers t)))

;; (use-package org-contrib)

;; Org Mode
(use-package org
  :straight (:type built-in)
  :bind
  ("C-c l" . org-store-link)
  :hook (org-mode . ns/org-mode-setup)
  :config
  ;; (ns/org-font-setup)
  :custom
  (org-ellipsis "…")
  (org-pretty-entities t)
  (org-hide-emphasis-markers t)

  (org-directory "~/Documents/notes")
  (org-default-notes-file "~/Documents/notes/notes.org")

  (org-src-tab-acts-natively t)
  (org-src-preserve-indentation t)

  (org-log-done 'time)    ; log the time when a task is *DONE*

  (org-todo-keywords
        '((sequence "TODO(t)" "NEXT(n)" "ACTIVE(a!)" "HOLD(h)" "|" "DONE(d!)"))))
            ;; (sequence "BACKLOG(b)" "PLAN(p)" "READY(r)" "ACTIVE(a)" "REVIEW(v)"
                ;; "WAIT(w@/!)" "HOLD(h)" "|" "COMPLETED(c)" "CANC(k@)"))))

#+end_src

** Org-appear: auto-reveal emphasis markers at point

#+BEGIN_SRC emacs-lisp
(use-package org-appear
  :straight (org-appear :type git :host github :repo "awth13/org-appear")
  :hook (org-mode . org-appear-mode))
#+END_SRC

** Fonts
Set up ~variable-pitch~ fonts.

#+BEGIN_SRC emacs-lisp

(add-hook 'org-mode-hook 'variable-pitch-mode)

(require 'org-faces)

;; Resize Org headings
(dolist (face '((org-level-1 . 1.2)
                (org-level-2 . 1.1)
                (org-level-3 . 1.05)
                (org-level-4 . 1.0)
                (org-level-5 . 1.1)
                (org-level-6 . 1.1)
                (org-level-7 . 1.1)
                (org-level-8 . 1.1)))
  (set-face-attribute (car face) nil :font "Iosevka Aile" :weight 'medium :height (cdr face)))

;; Make the document title a bit bigger
(set-face-attribute 'org-document-title nil :font "Iosevka Aile" :weight 'bold :height 1.3)

;; Make sure certain org faces continue to use fixed-pitch face even whenn variable-pitch-mode is on
(set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
(set-face-attribute 'org-table nil :inherit 'fixed-pitch)
(set-face-attribute 'org-formula nil :inherit 'fixed-pitch)
(set-face-attribute 'org-code nil :inherit '(shadow fixed-pitch))
(set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
(set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
(set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-facee fixed-pitch))
(set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)

#+END_SRC 

** Configure Babel
#+begin_src emacs-lisp
(org-babel-do-load-languages 'org-babel-load-languages
    '((emacs-lisp . t)
      (python . t)
      (clojure . t)
      (C . t)
      ;; (cpp . t)
      (shell . t)
      (eshell . t)
      (java . t)
      (js . t)
      (ruby . t)
      (sql . t)))

(setq org-confirm-babel-evaluate nil)
#+end_src

** Org-agenda and org-capture
Here's where I set up my agenda system. I like to keep an inbox file where I can quickly capture new items without thinking about them and then organize them into my main agenda file later when I have time. My agenda system was directly inspired by [[https://www.labri.fr/perso/nrougier/GTD/index.html][nrougier]] and [[https://github.com/gjstein/emacs.d/blob/master/config/gs-org-agenda.el][gjstein]].

*** Specify agenda files
#+BEGIN_SRC emacs-lisp
(setq org-agenda-files (list "inbox.org"
                             "agenda.org"
                             "projects.org"))
      ;org-agenda-hide-tags-regexp "."     ; hide all tags in the agenda
      
      ;; org-agenda-compact-blocks nil)
#+END_SRC 

*** Capture templates
Now, I need to set up some capture templates to quickly add items to the agenda.

#+BEGIN_SRC emacs-lisp

;; (setq org-capture-templates
;;        `(("i" "Inbox" entry  (file "agenda/inbox.org")
;;         ,(concat "* TODO %?\n"
;;                  "/Entered on/ %U"))
;;          ("m" "Meeting entry" entry (file+headline "agenda.org" "Future")
;;           ,(concat "* %? :meeting:\n"
;;                    "<%<%Y-%m-%d %a %H:00>>"))
;;          ("n" "Note" entry (file "notes.org")
;;           ,(concat "* Note (%a)\n"
;;                    "/Entered on/ %U\n" "\n" "%?"))))

(setq org-capture-templates
      '(("t" "todo" entry (file+headline "inbox.org" "Todo")
	     "* TODO %?\n%u\n%a\n" :clock-in t :clock-resume t)
        ;; ("m" "Meeting" entry (file "agenda/inbox.org")
        ;;  "* MEETING with %? :MEETING:\n%t" :clock-in t :clock-resume t)
        ("s" "Schedule an Appointment" entry (file+headline "agenda.org" "Future")
         "*** TODO %? \nSCHEDULED: %t")
        ("d" "Diary" entry (file+olp+datetree "diary.org")
         "* %?\n%U\n" :clock-in t :clock-resume t)
        ("i" "Idea" entry (file "inbox.org")
         "* %? :IDEA: \n%t" :clock-in t :clock-resume t)
        ("n" "High Priority Task" entry (file+headline "inbox.org" "Tasks")
         "** NEXT %? \nDEADLINE: %t") ))
#+END_SRC 

*** Refiling tasks
Make it easier to move tasks from the inbox or other files over to ~projects.org~, and automatically save all agenda files after refiling.

#+BEGIN_SRC emacs-lisp
(setq org-refile-targets
      '(("projects.org" :regexp . "\\(?:\\(?:Note\\|Task\\)s\\)"))
      org-refile-use-outline-path 'file
      org-outline-path-complete-in-steps nil)

(defun ns/org-agenda-save-buffers ()
  "Save `org-agenda-files` buffers without user confirmation."
  (interactive)
  (message "Saving org-agenda-files buffers...")
  (save-some-buffers t
                     (lambda ()
                       (when (member (buffer-file-name) (org-agenda-files))
                         t)))
  (message "Saving org-agenda-files buffers... done"))

;; Automatically save after refile
(advice-add 'org-refile :after
            (lambda (&rest _)
              (ns/org-agenda-save-buffers)))
#+END_SRC

*** Log when tasks are activated
Mark when tasks are first moved to the *NEXT* status courtesy of [[https://emacs.stackexchange.com/questions/35751][Erik Anderson]].

#+BEGIN_SRC emacs-lisp

(defun log-todo-next-creation-date (&rest ignore)
  "Log NEXT creation time in the property drawer under the key 'ACTIVATED'"
  (when (and (string= (org-get-todo-state) "NEXT")
             (not (org-entry-get nil "ACTIVATED")))
    (org-entry-put nil "ACTIVATED" (format-time-string "[%Y-%m-%d]"))))
(add-hook 'org-after-todo-state-change-hook #'log-todo-next-creation-date)

#+END_SRC 

