.emacs.d/config.org
*** Set up custom agenda blocks and views
I took most of the inspiration (and code) for this from [[https://github.com/gjstein/emacs.d/blob/master/config/gs-org-agenda.el]]

#+BEGIN_SRC emacs-lisp

(setq org-agenda-sticky t
      org-agenda-dim-blocked-tasks nil
      org-agenda-time-grid (quote
                            ((daily today remove-match)
                             (800 1200 1600 2000)
                             "......" "----------------")))

;; Variables for ignoring tasks with deadlines
(defvar ns/hide-deadline-next-tasks t)
(setq org-agenda-tags-todo-honor-ignore-options t
      org-deadline-warning-days 10)

;;;; Task and project filter functions

(defun ns/select-with-tag-function (select-fun-p)
  (save-restriction
    (widen)
    (let ((next-headline
           (save-excursion (or (outline-next-heading)
                               (point-max)))))
      (if (funcall select-fun-p) nil next-headline))))

;; Some helper functions for agenda views
(defun ns/org-agenda-add-location-string ()
  "Gets the value of the LOCATION property."
  (let ((loc (org-entry-get (point) "LOCATION")))
    (if (> (length loc) 0)
        (concat "{" loc "} ")
      "")))

;;;; Agenda block definitions

(defvar ns-org-agenda-block--today-schedule
  '(agenda "" ((org-agenda-overriding-header "Today's Schedule:")
               (org-agenda-span 'day)
               (org-agenda-ndays 1)
               (org-agenda-start-on-weekday nil)
               (org-agenda-start-day "+0d")))
  "A block showing a 1 day schedule.")

(defvar ns-org-agenda-block--weekly-log
  '(agenda "" ((org-agenda-overriding-header "Weekly Log")))
  "A block showing my schedule and logged tasks for this week.")

(defvar ns-org-agenda-block--previous-calendar-data
  '(agenda "" ((org-agenda-overriding-header "Previous Calendar Data (last 3 weeks)")
               (org-agenda-start-day "-21d")
               (org-agenda-span 21)
               (org-agenda-start-on-weekday nil)))
  "A block showing my schedule and logged tasks for the last few weeks.")

(defvar ns-org-agenda-block--upcoming-calendar-data
  '(agenda "" ((org-agenda-overriding-header "Upcoming Calendar Data (next 2 weeks)")
               (org-agenda-start-day "0d")
               (org-agenda-span 14)
               (org-agenda-start-on-weekday nil)))
  "A block showing my schedule for the next couple weeks.")

(defvar ns-org-agenda-block--refile
  '(tags "REFILE-ARCHIVE-REFILE=\"nil\"|INFO"
         ((org-agendda-overriding-header "Headings needing refiling or other info:")
          (org-tags-match-list-sublevels nil)))
  "Headings needing refiling or other info.")

(defvar ns-org-agenda-block--next-tasks
  '(tags-todo "-INACTIVE-SOMEDAY-CANCELLED-ARCHIVE/!NEXT"
              ((org-agenda-overriding-header "Next Tasks:")
               ))
  "Next tasks.")

(defvar ns-org-agenda-block--end-of-agenda
  '(tags "ENDOFAGENDA"
         ((org-agenda-overriding-header "End of Agenda")
          (org-tags-match-list-sublevels nil)))
  "End of the agenda.")

(defvar ns-org-agenda-display-settings
  '((org-agenda-start-with-log-mode t)
    (org-agenda-log-mode-items '(clock))
    (org-agenda-prefix-format '((agenda . "  %-12:c%?-12t %(ns/org-agenda-add-location-string)% s")
				(timeline . "  % s")
				(todo . "  %-12:c ")
				(tags . "  %-12:c ")
				(search . "  %i %-12:c")))
    (org-agenda-todo-ignore-deadlines 'near)
    (org-agenda-todo-ignore-scheduled t))
  "Display settings for my agenda views.")

(defvar ns-org-agenda-entry-display-settings
  '(,ns-org-agenda-display-settings
    (org-agenda-entry-text-mode t))
  "Display settings for my agenda views with entry text.")

(setq org-agenda-custom-commands
      `((" " "Export Schedule"
         (,ns-org-agenda-block--today-schedule
          ,ns-org-agenda-block--refile
          ,ns-org-agenda-block--next-tasks
          ,ns-org-agenda-block--end-of-agenda)
          ,ns-org-agenda-display-settings)
        ("L" "Weekly Log"
         (,ns-org-agenda-block--weekly-log)
         ,ns-org-agenda-display-settings)
        ("r " "Agenda Review (all)"
         (,ns-org-agenda-block--next-tasks
          ,ns-org-agenda-block--refile
          ,ns-org-agenda-block--end-of-agenda)
         ,ns-org-agenda-display-settings)
        ("rn" "Agenda Review (next tasks)"
         (,ns-org-agenda-block--next-tasks
          ,ns-org-agenda-block--end-of-agenda)
         ,ns-org-agenda-display-settings)
        ("rp" "Agenda Review (previous calendar data)"
         (,ns-org-agenda-block--previous-calendar-data
          ,ns-org-agenda-block--end-of-agenda)
         ,ns-org-agenda-display-settings)
        ("ru" "Agenda Review (upcoming calendar data)"
         (,ns-org-agenda-block--upcoming-calendar-data
          ,ns-org-agenda-block--end-of-agenda)
         ,ns-org-agenda-display-settings)
        ))

;; (setq org-agenda-custom-commands
;;       '(("g" "Get Things Done (GTD)"
;;          ((agenda ""
;;                   ((org-agenda-span 1) ; limit display to a single day
;;                    (org-agenda-skip-function
;;                     '(org-agenda-skip-entry-if 'deadline))
;;                    (org-deadline-warning-days 0)))
;;           (todo "NEXT"
;;                 ((org-agenda-skip-function
;;                   '(org-agenda-skip-entry-if 'deadline))
;;                  (org-agenda-prefix-format "  %i %-12:c [%e] ")
;;                  (org-agenda-overriding-header "\nTasks\n")))
;;           (agenda nil
;;                   ((org-agenda-entry-types '(:deadline))
;;                    (org-agenda-span 1)
;;                    (org-agenda-format-date "")
;;                    (org-deadline-warning-days 7)
;;                    (org-agenda-skip-function
;;                     '(org-agenda-skip-entry-if 'notregexp "\\* NEXT"))
;;                    (org-agenda-overriding-header "\nDeadlines")))
;;           (tags-todo "inbox"
;;                      ((org-agenda-prefix-format "  %?-12t% s")
;;                       (org-agenda-overriding-header "\nInbox\n")))
;;           (tags "CLOSED>=\"<today>\""
;;                 ((org-agenda-overriding-header "\nCompleted today\n")))))))

#+END_SRC 

Finally, define a keybinding for =org-capture= and opening up the =org-agenda=

#+BEGIN_SRC emacs-lisp

(keymap-global-set "C-c c" 'org-capture)
(keymap-global-set "C-c a" 'org-agenda)

#+END_SRC 
 
** Org-present

#+BEGIN_SRC emacs-lisp

(defun ns/org-present-begin ()
  (setq-local ns/olivetti-mode-enabled (bound-and-true-p olivetti-mode)) ;; remember if olivetti was already enabled or not
  (olivetti-mode 1)                                                      ;; enable olivetti-mode regardless

  ;; Tweak the font sizes
  (setq-local face-remapping-alist '((default (:height 1.5) variable-pitch)
                                     (header-line (:height 4.0) variable-pitch)
                                     (org-document-title (:height 1.75) org-document-title)
                                     (org-code (:height 1.55) org-code)
                                     (org-verbatim (:height 1.55) org-verbatim)
                                     (org-block (:height 1.25) org-block)
                                     (org-block-begin-line (:height 0.7) org-block)))

  ;; Set a blank header line string to create some blank space at the top
  (setq-local header-line-format " ")

  (message "Starting presentation. Good luck!"))

(defun ns/org-present-end ()
  (unless (symbol-value 'ns/olivetti-mode-enabled)
    (olivetti-mode 0))                                                   ;; disable olivetti-mode only if it wasn't open before the presentation

  ;; Reset the font customizations
  (setq-local face-remapping-alist '((default variable-pitch default)))

  ;; Reset the header line back to nothing
  (setq-local header-line-format nil)

  (message "Ending presentation. Nice job!"))

(use-package org-present
  :config
  (add-hook 'org-present-mode-hook 'ns/org-present-begin)
  (add-hook 'org-present-mode-quit-hook 'ns/org-present-end))

#+END_SRC 

