.emacs.d/config.org
** +Org-modern+
Give Org-mode documents some extra visual polish.

#+BEGIN_SRC emacs-lisp :tangle no

;; (use-package org-modern
;;   :config
;;   (global-org-modern-mode))
;;     :config
;;     (add-hook 'org-mode-hook #'org-modern-mode)
;;     (add-hook 'org-agenda-finalize #'org-modern-agenda))

#+END_SRC

* Note Taking
** Org-roam

#+BEGIN_SRC emacs-lisp
(use-package emacsql-sqlite-builtin)

(use-package org-roam
  :diminish
  :bind
  (:prefix-map ns/notes-prefix-map
               :prefix "C-c n"
               ("l" . org-roam-buffer-toggle)
               ("f" . org-roam-node-find)
               ("g" . org-roam-graph)
               ("i" . org-roam-node-insert)
               ("c" . org-roam-capture)
               ;; Dailies
               ("j" . org-roam-dailies-capture-today))
  :custom
  (org-roam-directory "~/Documents/notes/org-roam/")
  (org-roam-database-connector 'sqlite-builtin)
  (org-roam-capture-templates
   '(("d" "default" plain "%?"
      :target (file+head "%<%Y%m%d%H%M%S>-${slug}.org"
                         "#+title: ${title}\n#+date: %U\n")
      :unnarrowed t)
     ("r" "recipe" plain (file "~/notes/org-roam/templates/recipe-template.org")
      :target (file+head "%<%Y%m%d%H%M%S>-${slug}.org"
                         "#+title: ${title}\n#+date: %U\n#+filetags: Recipe\n")
      :unnarrowed t)))
  :init
  (setq org-roam-v2-ack t)
  :config
  (setq org-roam-node-display-template (concat "${title:*} " (propertize "${tags:10}" 'face 'org-tag)))
  (org-roam-db-autosync-enable))
#+END_SRC

** Org-roam-ui
#+BEGIN_SRC emacs-lisp
(use-package org-roam-ui
  :straight
    (:host github :repo "org-roam/org-roam-ui" :branch "main" :files ("*.el" "out"))
    :after org-roam
;;  :hook (after-init . org-roam-ui-mode)
    :custom
    (org-roam-ui-sync-theme t)
    (org-roam-ui-follow t)
    (org-roam-ui-update-on-save t)
    (org-roam-ui-open-on-start t))
#+END_SRC
** +Denote+

#+BEGIN_SRC emacs-lisp :tangle no
;; (use-package denote
;;   :straight (denote :type git :host gitlab
;;                     :repo "protesilaos/denote")
;;   :custom
;;   (denote-directory "~/notes")
;;   (denote-known-keywords
;;     '("emacs" "personal" "journal")))
#+END_SRC 

* Shells/Terminal Emulators
** term-mode

#+BEGIN_SRC emacs-lisp

(use-package term
  :custom
  (explicit-shell-file-name "/usr/bin/fish"))

(use-package eterm-256color
  :hook
  (term-mode . eterm-256color-mode))

#+END_SRC

** Vterm
#+BEGIN_SRC emacs-lisp

(use-package vterm
  :custom
  (vterm-shell "fish")
  (vterm-max-scrollback 10000))

(use-package multi-vterm
  :bind
  (:prefix-map ns/multi-vterm-prefix-map
               :prefix "C-c v"
               ("v" . multi-vterm)
               ("C-p" . multi-vterm-prev)
               ("p" . multi-vterm-prev)
               ("C-n" . multi-vterm-next)
               ("n" . multi-vterm-next)
               ("t" . multi-vterm-dedicated-toggle)
               ("p" . multi-vterm-project)))

#+END_SRC 

* Programming
** General Tools
*** LSP: Language-server protocols

#+begin_src emacs-lisp
;; (use-package lsp-mode
;;     :commands (lsp lsp-deferred)
;;     :custom
;;     (lsp-keymap-prefix "C-c l")
;;     (lsp-enable-which-key-integration t)
;;     (lsp-lens-enable t)
;;     (lsp-signature-auto-activate nil)
;;     (lsp-ui-doc-mode t))
;;     :custom

;;     ;; Enable/disable type hints as you type for Rust
;;     (lsp-rust-analyzer-server-display-inlay-hints t)
;;     (lsp-rust-analyzer-display-lifetime-elision-hints-enable "skip_trivial")
;;     (lsp-rust-analyzer-display-chaining-hints nil)
;;     (lsp-rust-analyzer-display-lifetime-elision-hints-use-parameter-names nil)
;;     (lsp-rust-analyzer-display-closure-return-type-hints t)
;;     (lsp-rust-analyzer-display-parameter-hints t)
;;     (lsp-rust-analyzer-display-reborrow-hints nil))

;; ;; (use-package lsp-ivy)

;; (use-package lsp-ui
;;     :hook (lsp-mode . lsp-ui-mode)
;;     :custom
;;     (lsp-ui-peek-always-show t)
;;     (lsp-ui-sideline-show-hover t)
;;     (lsp-ui-doc-position 'bottom)
;;     (lsp-ui-doc-enable nil))

#+end_src
 
*** Treesitter
This is a handy little hack I got from [[https://leba.dev/blog/2022/12/12/(ab)using-straightel-for-easy-tree-sitter-grammar-installations/]] to use ~Straight~ to compile and load Treesitter grammars for me

**** +Here's the function to compile grammars+

#+BEGIN_SRC emacs-lisp
;; (require 'treesit)
;; (defun ns/tree-sitter-compile-grammar (destination &optional path)
;;   "Compile grammar at PATH, and place the resulting shared library in DESTINATION."
;;   (interactive "fWhere should we put the shared library? \nfWhat tree-sitter grammar are we compiling? \n")
;;   (make-directory destination 'parents)

;;   (let* ((default-directory
;;           (expand-file-name "src/" (or path default-directory)))
;;          (parser-name
;;           (thread-last (expand-file-name "grammar.json" default-directory)
;;                        (json-read-file)
;;                        (alist-get 'name)))
;;          (emacs-module-url
;;           "https://raw.githubusercontent.com/casouri/tree-sitter-module/master/emacs-module.h")
;;          (tree-sitter-lang-in-url
;;           "https://raw.githubusercontent.com/casouri/tree-sitter-module/master/tree-sitter-lang.in")
;;          (needs-cpp-compiler nil))
;;     (message "Compiling grammar at %s" path)

;;     (url-copy-file emacs-module-url "emacs-module.h" :ok-if-already-exists)
;;     (url-copy-file tree-sitter-lang-in-url "tree-sitter-lang.in" :ok-if-already-exists)

;;     (with-temp-buffer
;;       (unless
;;           (zerop
;;            (apply #'call-process
;;                   (if (file-exists-p "scanner.cc") "c++" "cc") nil t nil
;;                   "parser.c" "-I." "--shared" "-o"
;;                   (expand-file-name
;;                    (format "libtree-sitter-%s%s" parser-name module-file-suffix)
;;                    destination)
;;                   (cond ((file-exists-p "scanner.c") '("scanner.c"))
;;                         ((file-exists-p "scanner.cc") '("scanner.cc")))))
;;         (user-error
;;          "Unable to compile grammar, please file a bug report\n%s"
;;          (buffer-string))))
;;     (message "Completed compilation")))
#+END_SRC 

**** +And here's where I install the grammars themselves+
#+BEGIN_SRC emacs-lisp
;; (use-package tree-sitter-rust
;;   :straight (:type git :host github :repo "tree-sitter/tree-sitter-rust"
;;              :post-build
;;              (ns/tree-sitter-compile-grammar
;;               (expand-file-name "ts-grammars" user-emacs-directory))))
#+END_SRC

**** (/for now/) just using the bash script directly
#+BEGIN_SRC emacs-lisp
(require 'treesit)
(setq treesit-extra-load-path (list (expand-file-name "ts-grammars" user-emacs-directory)))

;; (defun ns/compile-tree-sitter-grammar
;;     (language destination)
;;   (make-directory destination 'parents)
;;   (let ((shared-lib-name (format "libtree-sitter-%s.so" language)))
;;     (shell-command (concat "./build.sh" language))))
;;     ;; (f-move (concat "./dist/" shared-lib-name)
;;     ;;         (expand-file-name shared-lib-name destination))))

;; (defun ns/compile-tree-sitter-grammars
;;     (destination)
;;   (make-directory destination 'parents)
  
;;   ;; (async-start
;;    ;; (lambda ()
;;      (shell-command "./batch.sh")
;;      (f-move "./dist" destination))

;; (ns/compile-tree-sitter-grammars (expand-file-name "ts-grammars" user-emacs-directory))

;; (use-package tree-sitter-module
;;   :straight (:type git :host github :repo "casouri/tree-sitter-module"
;;                    :post-build (ns/compile-tree-sitter-grammars
;;                                 (expand-file-name "ts-grammars" user-emacs-directory))))
#+END_SRC

*** Company: Auto completion
A good code-completion package. I might consider switching to Corfu at some point.

#+begin_src emacs-lisp

;; (use-package company
;;     :hook (prog-mode . company-mode)
;;     :bind (:map company-active-map
;;         ("<tab>" . company-complete-selection))
;;         ;; (:map lsp-mode-map
;;         ;; ("<tab>" . company-indent-or-complete-common))
;;     :custom
;;     (company-minimum-prefix-length 1)
;;     (company-idle-delay 0.0))

;; ;; Adds colors and icons to company-mode
;; (use-package company-box
;;     :hook (company-mode . company-box-mode))

#+end_src

